###############################################################################################
# 一次遍历，不知道这什么辣鸡题
###########
# 时间复杂度：O(n)
# 空间复杂度：O(1)
###############################################################################################
class Solution:
    def balancedStringSplit(self, s: str) -> int:
        R = L = res = 0
        for ch in s:
            if ch == 'R':
                R += 1
            else:
                L += 1
            if R == L:
                res += 1
        return res