###############################################################################################
# 此题简单
###########
# 时间复杂度：O(log(2)n)，n为输入的数值，时间复杂度为以2为底数的log
# 空间复杂度：O(1)
###############################################################################################
class Solution:
    def isPowerOfTwo(self, n: int) -> bool:
        x = 1
        while 1:
            if x <= n:
                if x == n:
                    return True
                x *= 2
            else:
                return False