###############################################################################################
# 一开始没想到，还用哈希去存每个可以到达的位置，但此题的路径是线性的，不像图，因此只需要一个数就能存最远能到达的位置
# 射程内的都能到达，因此只需要遍历每一个点，只要当前点还在射程内，就更新最远可以到达的点
###########
# 时间复杂度：O(n)
# 空间复杂度：O(1)
###############################################################################################
class Solution:
    def canJump(self, nums: List[int]) -> bool:
        n = len(nums)
        max_achieve = 0
        for i in range(n):
            if i <= max_achieve:
                max_achieve = max(max_achieve, i + nums[i])
        return True if n-1 <= max_achieve else False
