###############################################################################################
# 直接二分，答案在左闭右闭区间内
###########
# 时间复杂度：O(log(n))
# 空间复杂度：O(1)
###############################################################################################
class Solution:
    def peakIndexInMountainArray(self, arr: List[int]) -> int:
        a, b = 0, len(arr)-1
        while a < b:
            mid = (a+b)//2
            if arr[mid] >= arr[mid+1]: # 当只有两个数，mid是小的那个，使用mid+1防止越界
                b = mid
            else:
                a = mid + 1
        return a